source/_posts/2014-03-11-rocking-with-tmux-tmuxinator-and-iterm2-for-rails-development.html
---
layout: post
title: "Rocking with tmux, tmuxinator, Guard, Zeus, and iTerm2 for Rails Development"
date: 2014-03-11 21:01:13 -1000
comments: true
categories: [tmux, zsh]
keywords: tmux, tmuxinator, iTerm2, rails 
description: tmux, tmuxinator, and iTerm2 tips for productivity with Rails Development
canonical: https://www.shakacode.com/blog/rocking-with-tmux-tmuxinator-and-iterm2-for-rails-development/
---

<p>
What's the most effective way to:
</p>
<ol class="org-ol">
<li>Start several different processes for Rails, such as Zeus, Rails server, rspec,
resque, and the scheduler.
</li>
<li>Have the output for each process in a separate tab.
</li>
<li>Not have the process pause when you scroll the output, as happens in tmux.
</li>
</ol>

<p>
Here's a short demo of using tmuxinator to get a project running in several
iterm2 tabs:
</p>

<p>
{% youtube 15Bxhu6-Xjc %}
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Why Guard?</h2>
<div class="outline-text-2" id="text-1">
<p>
I use <a href="https://github.com/guard/guard">Guard</a> for:
</p>
<ol class="org-ol">
<li>Automatically running rspec tests based on changes in either tests or source
files. Together with <a href="https://github.com/burke/zeus">Zeus</a>, I haven't found a faster way to get immediate
feedback from tests. <i>Pro tip: Learn how to use <code>:focus</code> with your specs to configure exactly what tests to have guard run.</i>
</li>
<li>Automatically restarting the server when needed. For example, if you change
gems or routes, you need to restart the server.
</li>
</ol>

<p>
While I love running Guard with Zeus, <a href="https://github.com/rails/spring">Spring</a> is the default in Rails 4.1, so
I'll probably give that a try in the near future.
</p>

<!-- more -->
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Why Tmuxinator and Tmux?</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://github.com/tmuxinator/tmuxinator">Tmuxinator</a> is awesome for configuring the layout of several processes.
</p>

<p>
Here's a sample tmuxinator file.
</p>

<p>
{% gist 9502375 %}
</p>

<p>
When I run the command
</p>

{% codeblock lang:bash %}
mux my_project
{% endcodeblock %}

<p>
And then I see the following. This is way easier than opening up tabs in iTerm2
and running commands every time.
</p>

<p>
{% img /images/2014-03-11-rocking-with-tmux-tmuxinator-and-iterm2-for-rails-development/tmuxinator-start.png %}
</p>

<p>
The main problem with this setup is that if you scroll a window backwards (using
the tmux keyboard bindings), and you don't un-scroll, then the process pauses,
such as the Rails server. <b>That's super annoying</b>. Often I'm running specs, and
I want to scroll back to see a stack trace, but that prevents the continuation
of the test run! Here's a <a href="http://stackoverflow.com/questions/13924365/rails-freezes-when-searching-through-tmux-output-buffer">short discussion of the issue</a>.
</p>

<!-- more -->
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">iTerm2 with tmux to the Rescue!</h2>
<div class="outline-text-2" id="text-3">
<p>
iTerm2 has <a href="https://code.google.com/p/iterm2/wiki/TmuxIntegration">wonderful tmux integration</a>. Here's the steps I take:
</p>
<ol class="org-ol">
<li>Be sure have the latest versions of tmux, tmuxinator and iTerm2. As of this
article, I'm using: tmux: 1.9a, tmuxinator: 0.6.7, iTerm2: Build
1.0.0.20140112.
</li>
<li>Configure your Tmux to open tabs rather than windows. This is key to getting
the iTerm2 version to look like your original tmux session.
</li>
</ol>

<p>
{% img /images/2014-03-11-rocking-with-tmux-tmuxinator-and-iterm2-for-rails-development/tmuxinator-configuration.png %}
</p>

<p>
Once you have the setup done, this is how I start my iTerm2-tmuxinator session:
</p>

<ol class="org-ol">
<li>Start tmuxinator with command <code>mux my_project</code>
</li>
<li>Hit <code>ctrl-a, d</code> to detach the tmux process.
</li>
<li>Run command =tmux -CC attach"
</li>
</ol>

<p>
Here's how it will look:
</p>

<p>
{% img /images/2014-03-11-rocking-with-tmux-tmuxinator-and-iterm2-for-rails-development/tmuxinator-iterm2-started.png %}
</p>

<p>
If you want to kill the session, you can run this command:
</p>
{% codeblock lang:bash %}
tmux kill-session -t my_project
{% endcodeblock %}

<p>
However, that sometimes does not kill all the processes. I often use these two
zsh scripts to ensure that everything is killed. It's super important to kill
Zeus before running db migrations or gem updates.
</p>

{% codeblock lang:bash %}
pgr() {
  for x in rails phantomjs zeus; do 
    pgrep -fl $x;
  done 
}

pgk() {
  for x in rails phantomjs zeus; do 
    pkill -fl $x;
  done 
}
{% endcodeblock %}
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Why Tmuxinator/tmux and not Foreman?</h2>
<div class="outline-text-2" id="text-4">
<p>
I use <a href="https://github.com/ddollar/foreman">Foreman</a> with Heroku and for running my rails server in production mode.
However, I prefer having different tabs provide console output for each of the
processes, rather than having all the console output blended together as Foreman
does. I'm also not sure if Foreman integrates with Guard.
</p>
</div>
</div>
